Refactored reference architecture
